export const alarmInfo = (value) => {
    if (value === 'Black Out') {
        return {
            value,
            descriptions: [
                'แรงดันไฟฟ้าที่ผิดปกติ สาเหตุส่วนใหญ่สามารถจำแนกได้ดังนี้',
                '- กรณีมิเตอร์ประกอบ CT/VT แรงสูง อาจเกิดจากหม้อแปลงแรงดันไฟฟ้า (VT) ชำรุด',
                '- เกิด Oxide ที่จุดต่อหรือจุดสัมผัสต่าง ๆ',
                '- สายคอนโทรลชำรุด',
                '- มิเตอร์ชำรุด',
                '- ละเมิด'
            ]
        };
    } else if (value === 'Voltage Drop') {
        return {
            value,
            descriptions: [
                'แรงดันไฟฟ้าที่ผิดปกติ สาเหตุส่วนใหญ่สามารถจำแนกได้ดังนี้',
                '- กรณีมิเตอร์ประกอบ CT/VT แรงสูง อาจเกิดจากหม้อแปลงแรงดันไฟฟ้า (VT) ชำรุด',
                '- เกิด Oxide ที่จุดต่อหรือจุดสัมผัสต่าง ๆ',
                '- สายคอนโทรลชำรุด',
                '- มิเตอร์ชำรุด',
                '- ละเมิด'
            ]
        };
    } else if (value === 'Over Voltage') {
        return {
            value,
            descriptions: [
                'แรงดันไฟฟ้าที่ผิดปกติ สาเหตุส่วนใหญ่สามารถจำแนกได้ดังนี้',
                '- กรณีมิเตอร์ประกอบ CT/VT แรงสูง อาจเกิดจากหม้อแปลงแรงดันไฟฟ้า (VT) ชำรุด',
                '- เกิด Oxide ที่จุดต่อหรือจุดสัมผัสต่าง ๆ',
                '- สายคอนโทรลชำรุด',
                '- มิเตอร์ชำรุด',
                '- ละเมิด'
            ]
        };
    } else if (value === 'Over Current') {
        return {
            value,
            descriptions: [
                'กระแสไฟฟ้ามีค่าสูงผิดปกติ สาเหตุส่วนใหญ่ สามารถจำแนกได้ดังนี้',
                '- ผู้ใช้ไฟฟ้าใช้โหลดเกินพิกัดหม้อแปลงกระแสไฟฟ้า',
                '- ผู้ใช้ไฟฟ้าดำเนินการเพิ่มขนาดหม้อแปลงโดยไม่ได้แจ้งให้ กฟภ. ทราบ',
                '- ผู้ใช้ไฟฟ้าใช้โหลดไม่สมดุลกัน ทำให้กระแสไฟฟ้าเฟสใดเฟสหนึ่งมีค่ามากกว่าปกติ',
                'หากตรวจพบว่าความผิดปกติเกิดจากสาเหตุข้างต้น เจ้าหน้าที่ กฟภ. ควรแนะนำวิธีการดำเนินการแก้ไขปัญหา และแจ้งผู้ใช้ไฟฟ้าเร่งดำเนินขอเพิ่มขนาดหม้อแปลงกระแสไฟฟ้า (CT) หรือหม้อแปลงไฟฟ้า ตามระเบียบของ กฟภ. ต่อไป'
            ]
        };
    }
}